const num = prompt("Введіть, будь ласка число від 1 до 100.");

numbersRange(num);

function numbersRange(num) {
  const numParse = Number.isFinite(parseFloat(num));

  if (numParse === false) {
    alert("Ви ввели не число.");
  } else if (numParse === true) {
    const n = parseInt(num);

    if (n === 0) {
        alert("Вибачте, але ви не ввели число, яке від 1 до 100.");
      } else if (n < 26) {
      alert("Дякую, за вашу відповідь, ваше число знаходиться в першій четверті.");
    } else if (n < 51) {
        alert("Дякую, за вашу відповідь, ваше число знаходиться в другій четверті.");
    } else if (n < 76) {
      alert("Дякую, за вашу відповідь, ваше число знаходиться в третій четверті.");
    } else if (n <= 100) {
      alert("Дякую, за вашу відповідь, ваше число знаходиться в четвертій четверті.");
    } else {
      alert("Вибачте, але ви не ввели число, яке від 1 до 100.");
    }
  }
}

/* 
4. Создайте скрипт, который просит ввести пользователя число от 1 до 100. 
Добавить проверку на то, что значние является числом,
на пустую строку, и на заданный диапазон (не меньше 1 и не больше 100). 
Выведите пользователю ответ в какой четверти лежит число.
1-25 (первая четверь), 26-50 (вторая четверть), 51-75 (третья четверть), 76-100 (четвертая четверть);
*/
