

/* 
9. Создайте игру "Угадай число". Попросите пользователя ввести сумму денег, которую он хочет поставить на игру. 
Попросите ввести диапазон чисел, в котором он хочет играть (например, от a до b). 
Выведите сумму, которую получит пользователь в том
случае, если угадает число. Сумма приза рассчитывается 
по формуле (b - a) * 0.1 + введенная пользователем сумма денег.
После чего запросите пользователя ввести число, добавьте проверку 
на заданный пользователем в начале диапазон (от а до b).
После ввода пользователем числа, сформируйте в скрипте рандомное 
число в заданном пользователем диапазоне (от a до b) 
(погуглите как получить рандомное число от числа до числа) и сравните 
введное пользователем число и сформированное рандомное
скриптом число. Если числа совпали, выведите в alert текст приветствия и сумму выигрыша, 
иначе сообщите о поражении и 
проигранное сумме. Не забудьте проверки типов данных и пустой строки на каждом пользовательском вводе;
*/