const question = prompt("В якій країні ти проживаєш?");

if (question.toLowerCase() === "") {
    alert("Введіть дані.");
    prompt("В якій країні ти проживаєш?");
  }  else if (typeof question ===  "number") {
    alert("Назва не може бути числом.");
    prompt("В якій країні ти проживаєш?");
  } 

  alert("Дякую, за вашу відповідь.");

/* 
1. С помощью функции prompt спросите у пользователя его страну проживания. 
Если пользователь ничего не ввел (пустая строка),
выведите сообщение "Введите данные", если пользователь ввел число, 
выведите сообщение "Название не может быть числом";
*/