

/* 
10. Создайте игру "Камень-ножницы-бумага". 
Попросите пользователя ввести строкой одно из значений. 
Проверьте правильность ввода.
Далее в скрипте напишите логику рандомного выбора одного 
из элементов игры и отобразите этот элемент пользователю. 
Введенный результат пользователя и сформированный скриптом 
рандомный результат обработайте по правилам игры. 
В зависимости от результата выведите пользователю 
сообщенение о том выиграл он или проиграл. 
Например: пользователь вводит Бумага, скрипт выводит Камень 
(рандомно сформированный результат), пользователю выводится 
сообщение о победе;
*/